package Sergey.HW.HW8;

// 1  Напишите функцию для преобразования имени в инициалы. Э https://www.codewars.com/kata/57eadb7ecd143f4c9c0000a3/train/java
//На выходе должны быть две заглавные буквы с точкой, разделяющей их.

//    String[] names = name.split(" ");
//    return (names[0].charAt(0) + "." + names[1].charAt(0)).toUpperCase();
////////////////////////////////////////////////////////////////////
// String[] init = name.split(" ");
//     return init[0].substring(0, 1).toUpperCase().concat("."+ init[1].substring(0, 1).toUpperCase());
////////////////////////////////////////////////////////////////////
//    name = name.toUpperCase();
//    return name.charAt(0) + "." + name.charAt(name.indexOf(" ") + 1);
////////////////////////////////////////////////////////////////////
//String x = name.charAt(0) + ".";

//for (int i = 0; i < name.length(); i++) {
//    if (name.charAt(i) == ' ') {
//        i++;
//        x += name.charAt(i);
//    }
//}
//return x.toUpperCase();
////////////////////////////////////////////////////////////////////
//        int index = name.indexOf(" ");
//        name = (name.substring(0, 1) + "." + name.substring(index + 1, (index + 2))).toUpperCase();
//
//        return name;
//2 У всех животных праздник! Каждое животное приносит одно блюдо. Есть только одно правило:
//блюдо должно начинаться и заканчиваться теми же буквами, что и имя животного. Например,
//большая голубая цапля приносит чесночный наан, а синица приносит шоколадный торт.
//Напишите функцию feast, которая принимает имя животного и блюдо в качестве аргументов и возвращает
//true или false, чтобы указать, разрешено ли животному принести блюдо на пир.
//Предположим, что beast и dish всегда строчные строки, и каждая из них состоит как минимум из двух букв.
// beast и dish может содержать дефисы и пробелы, но они не будут отображаться в начале или конце строки.
// О
//
//
//
// ни не будут содержать цифр.
//
//3 Создайте функцию, которая будет возвращать строку, объединяющую все буквы трех введенных строк в группы. Взяв
//первую букву всех входных данных и сгруппировав их рядом друг с другом.Сделайте это для каждой буквы,пример ниже!
//Например, ввод: "aa", "bb", "cc" => вывод: "abcabc"
//




//4 Получив букву, верните ее положение в алфавите.
//Ввод :: "а"
//Вывод :: "Позиция алфавита: 1"
//





// 5 Я новичок в кодировании, и теперь я хочу получить сумму двух массивов... на самом деле сумму всех их элементов.
// Я буду признателен за вашу помощь. https://www.codewars.com/kata/5a2be17aee1aaefe2a000151/solutions/java
//PS Каждый массив включает только целые числа. Выход - тоже число.
//        public static int arrayPlusArray(int[] arr1, int[] arr2) {
//        int sum = 0;
//        int sum1 = 0;
//        for (int i = 0; i < arr1.length; i ++) {
//        sum+= arr1[i];
//        }
//        for (int i = 0; i < arr1.length; i ++) {
//        sum1 += arr2[i];
//        }
//
//        return sum + sum1;
//        }
////////////////////////////////////////////////////////////////////
//return IntStream.of(arr1).sum() + IntStream.of(arr2).sum();
////////////////////////////////////////////////////////////////////
//    int sum = 0;
//    for (int i = 0; i < arr1.length; i++) {
//        sum += arr1[i] + arr2[i];
//    }
//      return sum;
//  }
////////////////////////////////////////////////////////////////////
//    int sum1=0,sum2=0;
//
//    for (int i:arr1)sum1+=i;
//    for (int i:arr2)sum2+=i;
//
//
//    return sum1+sum2;
//  }
//
//}
////////////////////////////////////////////////////////////////////
//    return Arrays.stream(arr1).sum() + Arrays.stream(arr2).sum();
//  }
//}


public class examples_solution_to_cw_8_1 {

    public static void main(String[] args) {

 //       System.out.println(abbrevName("stiv sigal")); //1



 //       System.out.println(arrayPlusArray(new int[]{1,2,3}, new int[]{4,5,6,})); //5


    }
}
