package Sergey.HW.HW8;

import org.w3c.dom.ls.LSOutput;

public class Hw8_4 {
    //3 Создайте функцию, которая будет возвращать строку, объединяющую все буквы трех введенных строк в группы. Взяв
//первую букву всех входных данных и сгруппировав их рядом друг с другом.Сделайте это для каждой буквы,пример ниже!
//Например, ввод: "aa", "bb", "cc" => вывод: "abcabc"

//   public static String tripleTrouble (String one, String two, String three) {
//       String[] str = new String[one.length()];
//       for (int i = 0; i < one.length(); i++) {

//       }
//   }



    public static void main(String[] args) {
   //     System.out.println(tripleTrouble("aa","bb","cc"));


        String str1 = "ab";
        System.out.println(str1.substring(1, 2));

    }
}
