//package JavaForBeginner.homework;
//
//import java.sql.SQLOutput;
//
//public class Hw4 {
//
//   public static int a = 1;
//
//    public static void printTask() {
//        String line = "===========================";
//        String str = "Task #";
//
//        System.out.println(line+"\n" + str + a++);
//    }
//    public static void main(String[] args) {
//
//        /** 3
//         * Записать в виде кода следующие логические выражения:
//         */
//       boolean i = (2 == 2) && (7 == 7);
//       boolean i1 = (!(15 < 3));
//       // boolean i2 = ("Сосна" = "Дуб") || ("Вишня" = "Клён"); false
//       // boolean i3 = !("Сосна" = "Дуб"); true
//        boolean i4 = (!!(15 < 3)) && (10 > 20);
//       // ("Глаза даны, чтобы видеть") И ("Под третьим этажом находится второй этаж"); - может быть
//       printTask();
//       System.out.println(i);
//       System.out.println(i1);
//       System.out.println(i4);
//
//        /** 4
//         * Записать в виде кода:
//         */
//        ("В минуте 70 секунд") || ("Работающие часы показывают время"); может быть
//        boolean i5 = (!(28 > 7)) && (!(300/5 = 60)); false
//         ("Телевизор - электрический прибор") && ("Стекло - дерево"); false
//         !((300 < 100))  → ("Жажду можно утолить водой"); - ???
//         (75 < 81) → (88 = 88)  - ???
//
//        /** 5
//         * Записать в виде кода следующие выражения:
//         */
//        а) Андрей > Светы. Наташа > Светы.
//        б) На полке стоят учебники, && на столе лежат справочники.
//        в) БОльшая детей — девочки. Остальные - мальчики.
//
//        /** 6      “Водительские права можно получить, только когда исполнится 16 лет.” может быть
//         *  7 ”Петя не едет в автобусе, но при этом читает книгу или не смотрит в окно”
//         *  8 “Если с другом ты, это хорошо, а когда наоборот - плохо”
//         *
//         *  9 Записать выражения в виде условий if-else:
//         */
//        if (тебе > 18) {
//            System.out.println("Взрослый");
//        }
//
//        if (Если земля сухая = нет дождя){
//        }  if else  Если земля мокрая, то идет дождь {
//        }
//
//        if Если земля сухая, =, нет дождя {
//        }  if else Если земля мокрая, то идет дождь. {
//        } else {
//            Иначе идет снег.
//        }
//
//        Если на небе тучи, идет дождь, иначе идет “слепой” дождь.
//                Если сегодня суббота, значит, завтра воскресенье. Если сегодня пятница, значит, вчера был четверг. Иначе вчера был не четверг, а завтра - не воскресенье
//        Если на горе свистнул рак, значит, прошла вечность, иначе ждите дальше.
//        Если тебе 18 или ты закончил школу, то ты можешь не жить с родителями, иначе живи с родителями.
//
//        /** Part 2 10
//         * Проверьте число на четность. Если число четное, удвойте это число, иначе возведите число в квадрат.
//         * Выведите результат работы алгоритма на печать.
//         * Найдите в презентации, какой блок схеме соответствует ваш алгоритм.
//         */
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//    }
//}
//